Autodesk.Navisworks.Api.Selection
Represents a selection as either an explicit collection of ModelItems or as a collection of SelectionSources that will generate a selection on demand.

Autodesk.Navisworks.Api.Selection.#ctor
Create a clear selection

Autodesk.Navisworks.Api.Selection.#ctor(Autodesk.Navisworks.Api.ModelItemCollection)
Create a selection as a explicit collection of ModelItems
Throws System.ArgumentNullException:
Argument 'from' is null
Throws System.ArgumentException:
Argument 'from' has been Disposed
Throws System.ArgumentException:
Argument 'from' is associated with a different document

Autodesk.Navisworks.Api.Selection.#ctor(Autodesk.Navisworks.Api.Selection)
Create a copy of another selection
Throws System.ArgumentNullException:
Argument 'from' is null
Throws System.ArgumentException:
Argument 'from' has been Disposed
Throws System.ArgumentException:
Argument 'from' is associated with a different document

Autodesk.Navisworks.Api.Selection.#ctor(Autodesk.Navisworks.Api.SelectionSourceCollection)
Create a selection as a collection of SelectionSources
Throws System.ArgumentNullException:
Argument 'from' is null
Throws System.ArgumentException:
Argument 'from' has been Disposed
Throws System.ArgumentException:
Argument 'from' is associated with a different document

Autodesk.Navisworks.Api.Selection.Clear
Reset selection to the default state, explicit and nothing selected
Throws System.ObjectDisposedException:
Object has been Disposed
Throws System.NotSupportedException:
Object is Read-Only

Autodesk.Navisworks.Api.Selection.CopyFrom(Autodesk.Navisworks.Api.ModelItemCollection)
Initialise as explicit selection with a copy of items
Throws System.ObjectDisposedException:
Object has been Disposed
Throws System.NotSupportedException:
Object is Read-Only
Throws System.ArgumentNullException:
Argument 'from' is null
Throws System.ArgumentException:
Argument 'from' has been Disposed
Throws System.ArgumentException:
Argument 'from' is associated with a different document

Autodesk.Navisworks.Api.Selection.CopyFrom(Autodesk.Navisworks.Api.Selection)
Initialise selection with a copy of another selection
Throws System.ObjectDisposedException:
Object has been Disposed
Throws System.NotSupportedException:
Object is Read-Only
Throws System.ArgumentNullException:
Argument 'from' is null
Throws System.ArgumentException:
Argument 'from' has been Disposed
Throws System.ArgumentException:
Argument 'from' is associated with a different document

Autodesk.Navisworks.Api.Selection.CopyFrom(Autodesk.Navisworks.Api.SelectionSourceCollection)
Initialise as collection of SelectionSources
Throws System.ObjectDisposedException:
Object has been Disposed
Throws System.NotSupportedException:
Object is Read-Only
Throws System.ArgumentNullException:
Argument 'from' is null
Throws System.ArgumentException:
Argument 'from' has been Disposed
Throws System.ArgumentException:
Argument 'from' is associated with a different document

Autodesk.Navisworks.Api.Selection.CopyFrom(System.Collections.Generic.IEnumerable{Autodesk.Navisworks.Api.ModelItem})
Initialise as explicit selection with items in from
from: The collection to copy contents from
Throws System.NotSupportedException:
Object is Read-Only

Autodesk.Navisworks.Api.Selection.ExplicitSelection
Selection as explicit collection of ModelItems
Throws System.InvalidOperationException:
Invalid operation when '!HasExplicitSelection'
Throws System.ObjectDisposedException:
Object has been Disposed

Autodesk.Navisworks.Api.Selection.GetSelectedItems
Returns a ModelItemCollection that represents the items specified by this Selection in the document
which it is associated with.
Throws System.NotSupportedException:
No document is associated with this selection

Autodesk.Navisworks.Api.Selection.GetSelectedItems(Autodesk.Navisworks.Api.Document)
Returns a ModelItemCollection that represents the items specified by this Selection in document.
Throws System.InvalidOperationException:
Selection contains explicit items from a different document

Autodesk.Navisworks.Api.Selection.HasExplicitSelection
Does this selection contain an explicit collection of ModelItems ?
Throws System.ObjectDisposedException:
Object has been Disposed

Autodesk.Navisworks.Api.Selection.HasSelectionSources
Does this selection contain a collection of SelectionSources ?
Throws System.ObjectDisposedException:
Object has been Disposed

Autodesk.Navisworks.Api.Selection.IsClear
Is this the default selection (explicit and nothing selected) ?
Throws System.ObjectDisposedException:
Object has been Disposed

Autodesk.Navisworks.Api.Selection.IsReadOnly
Gets a value indicating whether the object is read-only.

Autodesk.Navisworks.Api.Selection.SelectAll
Initialises selection with a selection source that selects everything in document when resolved
Throws System.ObjectDisposedException:
Object has been Disposed
Throws System.NotSupportedException:
Object is Read-Only

Autodesk.Navisworks.Api.Selection.SelectionSources
Selection as collection of SelectionSources
Throws System.InvalidOperationException:
Invalid operation when '!(HasSelectionSources || IsClear)'
Throws System.ObjectDisposedException:
Object has been Disposed

Autodesk.Navisworks.Api.Selection.ValueEquals(Autodesk.Navisworks.Api.Selection)
Performs comparison 'By Value'

Autodesk.Navisworks.Api.Selection.ValueEquals(Autodesk.Navisworks.Api.Selection,Autodesk.Navisworks.Api.Selection)
Compares the two references 'By Value'